fonecmid-diplom/src/Documents/BKM_НачислениеФиксированнойПремии/BKM_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BKM_НачислениеФиксированнойПремии</name>
  <registerRecords>CalculationRegister.BKM_ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.BKM_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.BKM_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/BKM_ДополнительныеНачисления/BKM_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>BKM_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.BKM_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/BKM_Удержания/BKM_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>BKM_Удержания</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.BKM_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/BKM_ВзаиморасчетыССотрудниками/BKM_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>BKM_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/BKM_НачислениеФиксированнойПремии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СформироватьДвиженияДополнительныеНачисления();
	СформироватьДвиженияУдержания();
	РасчитатьУдержания();
	СформироватьДвиженияВзаиморасчеты();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияДополнительныеНачисления()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	BKM_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник КАК Сотрудник,
		|	BKM_НачислениеФиксированнойПремииСписокСотрудников.СуммаПремии КАК СуммаПремии,
		|	НАЧАЛОПЕРИОДА(&Дата, Месяц) КАК БазовыйПериодНачало,
		|	КОНЕЦПЕРИОДА(&Дата, Месяц) КАК БазовыйПериодКонец
		|ИЗ
		|	Документ.BKM_НачислениеФиксированнойПремии.СписокСотрудников КАК BKM_НачислениеФиксированнойПремииСписокСотрудников
		|ГДЕ
		|	BKM_НачислениеФиксированнойПремииСписокСотрудников.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.BKM_ДополнительныеНачисления.Добавить();
		Движение.Результат = Выборка.СуммаПремии;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.БазовыйПериодНачало = Выборка.БазовыйПериодНачало;
		Движение.БазовыйПериодКонец = Выборка.БазовыйПериодКонец;
		Движение.ВидРасчета = ПланыВидовРасчета.BKM_ДополнительныеНачисления.Премия;
		Движение.ПериодРегистрации = НачалоМесяца(Дата);
	КонецЦикла;
	
	Движения.BKM_ДополнительныеНачисления.Записать();

КонецПроцедуры

Процедура СформироватьДвиженияУдержания()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	BKM_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	BKM_ДополнительныеНачисления.БазовыйПериодНачало КАК БазовыйПериодНачало,
		|	BKM_ДополнительныеНачисления.БазовыйПериодКонец КАК БазовыйПериодКонец,
		|	BKM_ДополнительныеНачисления.ПериодРегистрации КАК ПериодРегистрации
		|ИЗ
		|	РегистрРасчета.BKM_ДополнительныеНачисления КАК BKM_ДополнительныеНачисления
		|ГДЕ
		|	BKM_ДополнительныеНачисления.Регистратор = &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	BKM_ДополнительныеНачисления.Сотрудник,
		|	BKM_ДополнительныеНачисления.БазовыйПериодНачало,
		|	BKM_ДополнительныеНачисления.БазовыйПериодКонец,
		|	BKM_ДополнительныеНачисления.ПериодРегистрации";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДвижениеУдержание = Движения.BKM_Удержания.Добавить();
		ЗаполнитьЗначенияСвойств(ДвижениеУдержание, ВыборкаДетальныеЗаписи);
		ДвижениеУдержание.ВидРасчета = ПланыВидовРасчета.BKM_Удержания.НДФЛ;
	КонецЦикла;
	
	Движения.BKM_Удержания.Записать();
	
КонецПроцедуры

Процедура РасчитатьУдержания()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	BKM_УдержанияБазаBKM_ДополнительныеНачисления.РезультатБаза КАК РезультатБаза,
		|	BKM_УдержанияБазаBKM_ДополнительныеНачисления.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	РегистрРасчета.BKM_Удержания.БазаBKM_ДополнительныеНачисления(&Измерения, &Измерения, &Регистратор,
		|		Регистратор = &Ссылка
		|	И ПериодРегистрации = НАЧАЛОПЕРИОДА(&Дата, Месяц)) КАК BKM_УдержанияБазаBKM_ДополнительныеНачисления";
	
	Запрос.УстановитьПараметр("Дата", Дата);
		
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	Разрезы = Новый Массив;
    Разрезы.Добавить("Регистратор");
    Запрос.УстановитьПараметр("Регистратор", Разрезы);
    
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДвижениеУдрежания = Движения.BKM_Удержания[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		ДвижениеУдрежания.Значение = ВыборкаДетальныеЗаписи.РезультатБаза / 13
	КонецЦикла;
	
	Движения.BKM_Удержания.Записать( ,Истина);
	
КонецПроцедуры

Процедура СформироватьДвиженияВзаиморасчеты()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	BKM_Удержания.Значение КАК РезультатУдержания,
		|	BKM_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	СУММА(BKM_ДополнительныеНачисления.Результат) КАК РезультатДоп
		|ИЗ
		|	РегистрРасчета.BKM_ДополнительныеНачисления КАК BKM_ДополнительныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.BKM_Удержания КАК BKM_Удержания
		|		ПО BKM_ДополнительныеНачисления.Сотрудник = BKM_Удержания.Сотрудник
		|		И BKM_ДополнительныеНачисления.Регистратор = BKM_Удержания.Регистратор
		|СГРУППИРОВАТЬ ПО
		|	BKM_Удержания.Значение,
		|	BKM_ДополнительныеНачисления.Сотрудник";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения.BKM_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.BKM_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Регистратор = Ссылка;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Сумма = ВыборкаДетальныеЗаписи.РезультатДоп - ВыборкаДетальныеЗаписи.РезультатУдержания;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
